#include <iostream>
#include "HeroFabrics.h"
#include "KittyHero.h"
#include <locale>
#include "Game.h"

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!   мое АВТОРИТЕТНОЕ МНЕНИЕ ОБ  С++    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  C++ ХУЙНЯ ПРОСТО ЕБАНАЯ ФУ БЛЯТЬ    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  ГАВНИЩЕ ЕБАНОЕ ХУЕТА БЛЯДСКАЯЯЯЯ    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  СУКА УЕБЩИНЫЙ ВЕКТОР НИСХУЯ БЛЯТЬ НЕ ЗАПИСЫВАЕТ ГЕРОЕВ МОИХ ПРИПЕЗДЕННЫЙ    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// 
// 
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ТУТ БУДУ ХУЕСОСИТЬ IDE ГОВНА ЕБАНОГО !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

int main() {
    setlocale(0,"rus");
    Game game = Game();
    game.startOfGame();
    game.gameProcess();


    return 0;
}
